In [10]:
import pandas as pd
import numpy as np

# 500개의 값을 갖는 시리즈 생성

nums = pd.Series(range(500))
nums

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [4]:
nums.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [6]:
nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [11]:
nums = pd.Series([1,2, np.nan, 4,5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [12]:
nums.count()

4

In [13]:
len(nums)

5

In [14]:
nums.head(10)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [15]:
hello = pd.Series(list("hello"))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [16]:
hello.nunique()

4

In [17]:
nums.sum()

12.0

In [18]:
nums.sum(skipna=False)

nan

In [19]:
nums.mean()

3.0

In [20]:
nums.median()

3.0

In [21]:
nums.std()

1.8257418583505538

In [22]:
nums.max()

5.0

In [23]:
nums.min()

1.0

In [24]:
somechar = pd.Series(list("AaBbCc"))
somechar

0    A
1    a
2    B
3    b
4    C
5    c
dtype: object

In [25]:
somechar.max()

'c'

In [26]:
somechar.min()

'A'

In [28]:
ord('a')

97

In [29]:
ord('A')

65

In [30]:
ord('b')

98

In [31]:
nums.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [32]:
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

In [33]:
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [34]:
list(nums)

[1.0, 2.0, nan, 4.0, 5.0]

In [35]:
dict(nums)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [40]:
superheros = [ "Batman",
"Superman", "Spider-Man", "Iron Man", "Captain America", "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

a = pd.Series(data = strength_levels, index = [superheros])
a

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [43]:
# 생략 ㅇ

a = pd.Series(strength_levels, [superheros])
a

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [44]:
a.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [46]:
a.nunique()

5

In [48]:
a.mean()

105.83333333333333

In [49]:
a.median()

105.0

In [50]:
a.max()

120

In [51]:
a.min()

90

In [52]:
dict(a)

{('Batman',): 100,
 ('Superman',): 120,
 ('Spider-Man',): 90,
 ('Iron Man',): 95,
 ('Captain America',): 110,
 ('Wonder Woman',): 120}

In [60]:
# squeeze 매개변수는 하나의 열을 갖는 DataFrame을 Series로 변환
# index_col은 index로 사용할 column을 지정

pokemons = pd.read_csv("/Users/ye/23_Data analysis/ignore/pokemon.csv", index_col="Pokemon", squeeze=True)
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [61]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [62]:
# 이렇게 넣으면 데이터프레임으로 가져온다.

pd.read_csv("ignore/pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [90]:
pokemons.sort_index(ascending=True)

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [63]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [64]:
pokemons.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [65]:
# 내림차순 정렬
pokemons.sort_values(ascending = False)

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [69]:
# parse_dates는 csv파일에서 데이터를 읽어들일 때
# 날짜/시간으로 파싱해야 하는 컬럼을 지정할 수 있습니다.

google = pd.read_csv("ignore/google_stocks.csv",
                    parse_dates = ["Date"],
                    index_col = "Date",
                    squeeze = True)
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [70]:
# usecols 인수를 활용하면
# csv 파일로부터 팬더스가 가져와야 하는 열의 목록을 지정할 수 있습니다.

war = pd.read_csv("ignore/revolutionary_war.csv",
                 parse_dates = ["Start Date"],
                 index_col = "Start Date",
                 usecols = ["Start Date", "State"],
                 squeeze = True
                 )
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [72]:
dict(war)

{Timestamp('1774-09-01 00:00:00'): 'Massachusetts',
 Timestamp('1774-12-14 00:00:00'): 'New Hampshire',
 Timestamp('1775-04-19 00:00:00'): Start Date
 1775-04-19    Massachusetts
 1775-04-19    Massachusetts
 Name: State, dtype: object,
 Timestamp('1775-04-20 00:00:00'): 'Virginia',
 Timestamp('1775-05-10 00:00:00'): 'New York',
 Timestamp('1775-05-27 00:00:00'): 'Massachusetts',
 Timestamp('1775-06-11 00:00:00'): 'Massachusetts',
 Timestamp('1775-06-17 00:00:00'): 'Massachusetts',
 Timestamp('1775-08-08 00:00:00'): 'Massachusetts',
 Timestamp('1775-09-17 00:00:00'): nan,
 Timestamp('1775-10-18 00:00:00'): 'Massachusetts',
 Timestamp('1775-11-14 00:00:00'): 'Virginia',
 Timestamp('1775-11-19 00:00:00'): 'South Carolina',
 Timestamp('1775-12-09 00:00:00'): 'Virginia',
 Timestamp('1775-12-01 00:00:00'): 'South Carolina',
 Timestamp('1775-12-31 00:00:00'): nan,
 Timestamp('1776-01-01 00:00:00'): 'Virginia',
 Timestamp('1776-02-27 00:00:00'): 'North Carolina',
 Timestamp('1776-03-02 00:00:00'): 'Georgia',
 Timestamp('1776-03-03 00:00:00'): nan,
 Timestamp('1776-03-25 00:00:00'): nan,
 Timestamp('1776-04-06 00:00:00'): 'Rhode Island',
 Timestamp('1776-05-18 00:00:00'): nan,
 Timestamp('1776-06-08 00:00:00'): nan,
 Timestamp('1776-06-28 00:00:00'): 'South Carolina',
 Timestamp('1776-06-29 00:00:00'): 'New Jersey',
 Timestamp('1776-07-15 00:00:00'): 'South Carolina',
 Timestamp('1776-08-27 00:00:00'): 'New York',
 Timestamp('1776-09-15 00:00:00'): 'New York',
 Timestamp('1776-09-16 00:00:00'): 'New York',
 Timestamp('1776-10-11 00:00:00'): 'New York',
 Timestamp('1776-10-28 00:00:00'): 'New York',
 Timestamp('1776-11-10 00:00:00'): nan,
 Timestamp('1776-11-16 00:00:00'): 'New York',
 Timestamp('1776-11-20 00:00:00'): 'New Jersey',
 Timestamp('1776-12-14 00:00:00'): 'New Jersey',
 Timestamp('1776-12-22 00:00:00'): 'New Jersey',
 Timestamp('1776-12-26 00:00:00'): 'New Jersey',
 Timestamp('1777-01-02 00:00:00'): 'New Jersey',
 Timestamp('1777-01-03 00:00:00'): 'New Jersey',
 Timestamp('1777-01-20 00:00:00'): 'New Jersey',
 NaT: Start Date
 NaT    New Jersey
 NaT      Virginia
 NaT           NaN
 NaT           NaN
 Name: State, dtype: object,
 Timestamp('1777-03-08 00:00:00'): 'New Jersey',
 Timestamp('1777-04-13 00:00:00'): 'New Jersey',
 Timestamp('1777-04-27 00:00:00'): 'Connecticut',
 Timestamp('1777-05-17 00:00:00'): 'Florida',
 Timestamp('1777-05-24 00:00:00'): 'New York',
 Timestamp('1777-06-26 00:00:00'): 'New Jersey',
 Timestamp('1777-07-05 00:00:00'): 'New York',
 Timestamp('1777-07-07 00:00:00'): 'Vermont',
 Timestamp('1777-07-08 00:00:00'): 'New York',
 Timestamp('1777-08-02 00:00:00'): 'New York',
 Timestamp('1777-08-06 00:00:00'): 'New York',
 Timestamp('1777-08-13 00:00:00'): 'Massachusetts',
 Timestamp('1777-08-16 00:00:00'): 'New York',
 Timestamp('1777-08-22 00:00:00'): Start Date
 1777-08-22    New York
 1777-08-22    New York
 Name: State, dtype: object,
 Timestamp('1777-09-03 00:00:00'): 'Delaware',
 Timestamp('1777-09-11 00:00:00'): 'Pennsylvania',
 Timestamp('1777-09-16 00:00:00'): 'Pennsylvania',
 Timestamp('1777-09-19 00:00:00'): 'New York',
 Timestamp('1777-09-21 00:00:00'): 'Pennsylvania',
 Timestamp('1777-09-26 00:00:00'): 'Pennsylvania',
 Timestamp('1777-10-04 00:00:00'): 'Pennsylvania',
 Timestamp('1777-10-06 00:00:00'): 'New York',
 Timestamp('1777-10-07 00:00:00'): 'New York',
 Timestamp('1777-10-22 00:00:00'): 'New Jersey',
 Timestamp('1777-11-25 00:00:00'): 'New Jersey',
 Timestamp('1777-12-05 00:00:00'): 'Pennsylvania',
 Timestamp('1777-12-11 00:00:00'): 'Pennsylvania',
 Timestamp('1778-03-07 00:00:00'): nan,
 Timestamp('1778-03-18 00:00:00'): 'New Jersey',
 Timestamp('1778-04-24 00:00:00'): nan,
 Timestamp('1778-05-01 00:00:00'): 'Pennsylvania',
 Timestamp('1778-05-20 00:00:00'): 'Pennsylvania',
 Timestamp('1778-05-25 00:00:00'): 'Rhode Island',
 Timestamp('1778-05-30 00:00:00'): 'New York',
 Timestamp('1778-06-28 00:00:00'): 'New Jersey',
 Timestamp('1778-06-30 00:00:00'): 'Florida',
 Timestamp('1778-07-03 00:00:00'): 'Pennsylvania',
 Timestamp('1778-07-27 00:00:00'): nan,
 Timestamp('1778-08-21 00:00:00'): nan,
 Timestamp('1778-08-29 00:00:00'): 'Rhode Island',
 Timestamp('1778-09-05 00:00:00'): 'Massachusetts',
 Timestamp('1778-09-07 00:00:00'): Start Date
 1778-09-07         NaN
 1778-09-07    Virginia
 Name: State, dtype: object,
 Timestamp('1778-09-17 00:00:00'): 'New York',
 Timestamp('1778-09-27 00:00:00'): 'New Jersey',
 Timestamp('1778-02-16 00:00:00'): nan,
 Timestamp('1778-10-06 00:00:00'): 'New Jersey',
 Timestamp('1778-10-16 00:00:00'): 'New Jersey',
 Timestamp('1778-10-24 00:00:00'): 'Vermont',
 Timestamp('1778-11-11 00:00:00'): 'New York',
 Timestamp('1778-12-15 00:00:00'): nan,
 Timestamp('1778-12-18 00:00:00'): nan,
 Timestamp('1778-12-29 00:00:00'): 'Georgia',
 Timestamp('1779-02-03 00:00:00'): 'South Carolina',
 Timestamp('1779-02-14 00:00:00'): 'Georgia',
 Timestamp('1779-02-23 00:00:00'): 'Indiana',
 Timestamp('1779-03-03 00:00:00'): 'Georgia',
 Timestamp('1779-05-01 00:00:00'): nan,
 Timestamp('1779-05-10 00:00:00'): 'Virginia',
 Timestamp('1779-06-16 00:00:00'): nan,
 Timestamp('1779-06-20 00:00:00'): 'South Carolina',
 Timestamp('1779-06-24 00:00:00'): nan,
 Timestamp('1779-07-02 00:00:00'): nan,
 Timestamp('1779-07-05 00:00:00'): 'Connecticut',
 Timestamp('1779-07-06 00:00:00'): nan,
 Timestamp('1779-07-16 00:00:00'): 'New York',
 Timestamp('1779-07-22 00:00:00'): 'New York',
 Timestamp('1779-07-24 00:00:00'): 'Massachusetts',
 Timestamp('1779-08-19 00:00:00'): 'New Jersey',
 Timestamp('1779-08-29 00:00:00'): nan,
 Timestamp('1779-09-07 00:00:00'): 'Florida',
 Timestamp('1779-09-10 00:00:00'): 'Florida',
 Timestamp('1779-09-13 00:00:00'): nan,
 Timestamp('1779-09-14 00:00:00'): nan,
 Timestamp('1779-09-16 00:00:00'): 'Georgia',
 Timestamp('1779-09-20 00:00:00'): 'Florida',
 Timestamp('1779-09-23 00:00:00'): nan,
 Timestamp('1779-10-16 00:00:00'): nan,
 Timestamp('1779-11-11 00:00:00'): nan,
 Timestamp('1779-12-18 00:00:00'): nan,
 Timestamp('1780-01-08 00:00:00'): nan,
 Timestamp('1780-01-16 00:00:00'): nan,
 Timestamp('1780-02-03 00:00:00'): 'New York',
 Timestamp('1780-03-02 00:00:00'): 'Florida',
 Timestamp('1780-03-29 00:00:00'): 'South Carolina',
 Timestamp('1780-04-14 00:00:00'): 'South Carolina',
 Timestamp('1780-04-17 00:00:00'): nan,
 Timestamp('1780-05-06 00:00:00'): 'South Carolina',
 Timestamp('1780-05-25 00:00:00'): Start Date
 1780-05-25     Virginia
 1780-05-25    Louisiana
 Name: State, dtype: object,
 Timestamp('1780-05-29 00:00:00'): 'South Carolina',
 Timestamp('1780-06-07 00:00:00'): 'New Jersey',
 Timestamp('1780-06-10 00:00:00'): 'South Carolina',
 Timestamp('1780-06-20 00:00:00'): 'North Carolina',
 Timestamp('1780-06-23 00:00:00'): 'New Jersey',
 Timestamp('1780-07-12 00:00:00'): 'South Carolina',
 Timestamp('1780-07-20 00:00:00'): 'New Jersey',
 Timestamp('1780-07-21 00:00:00'): 'North Carolina',
 Timestamp('1780-08-01 00:00:00'): 'South Carolina',
 Timestamp('1780-08-06 00:00:00'): 'South Carolina',
 Timestamp('1780-08-08 00:00:00'): nan,
 Timestamp('1780-08-09 00:00:00'): nan,
 Timestamp('1780-08-16 00:00:00'): 'South Carolina',
 Timestamp('1780-08-18 00:00:00'): Start Date
 1780-08-18    South Carolina
 1780-08-18    South Carolina
 Name: State, dtype: object,
 Timestamp('1780-08-28 00:00:00'): 'South Carolina',
 Timestamp('1780-09-20 00:00:00'): 'South Carolina',
 Timestamp('1780-09-26 00:00:00'): 'North Carolina',
 Timestamp('1780-10-07 00:00:00'): 'South Carolina',
 Timestamp('1780-10-16 00:00:00'): 'Vermont',
 Timestamp('1780-10-19 00:00:00'): 'New York',
 Timestamp('1780-11-05 00:00:00'): nan,
 Timestamp('1780-11-09 00:00:00'): 'South Carolina',
 Timestamp('1780-11-20 00:00:00'): 'South Carolina',
 Timestamp('1780-11-23 00:00:00'): 'New York',
 Timestamp('1781-01-06 00:00:00'): nan,
 Timestamp('1781-01-07 00:00:00'): 'Florida',
 Timestamp('1781-01-17 00:00:00'): 'South Carolina',
 Timestamp('1781-02-01 00:00:00'): 'North Carolina',
 Timestamp('1781-02-03 00:00:00'): nan,
 Timestamp('1781-02-25 00:00:00'): 'North Carolina',
 Timestamp('1781-03-06 00:00:00'): 'North Carolina',
 Timestamp('1781-03-09 00:00:00'): 'Florida',
 Timestamp('1781-03-15 00:00:00'): 'North Carolina',
 Timestamp('1781-03-16 00:00:00'): 'Virginia',
 Timestamp('1781-04-15 00:00:00'): Start Date
 1781-04-15    South Carolina
 1781-04-15               NaN
 Name: State, dtype: object,
 Timestamp('1781-04-25 00:00:00'): Start Date
 1781-04-25          Virginia
 1781-04-25    South Carolina
 Name: State, dtype: object,
 Timestamp('1781-04-29 00:00:00'): nan,
 Timestamp('1781-05-01 00:00:00'): nan,
 Timestamp('1781-05-08 00:00:00'): 'South Carolina',
 Timestamp('1781-05-22 00:00:00'): Start Date
 1781-05-22           Georgia
 1781-05-22    South Carolina
 Name: State, dtype: object,
 Timestamp('1781-05-24 00:00:00'): nan,
 Timestamp('1781-05-30 00:00:00'): nan,
 Timestamp('1781-06-26 00:00:00'): 'Virginia',
 Timestamp('1781-07-01 00:00:00'): 'Virginia',
 Timestamp('1781-07-06 00:00:00'): 'Virginia',
 Timestamp('1781-07-21 00:00:00'): nan,
 Timestamp('1781-08-05 00:00:00'): nan,
 Timestamp('1781-08-19 00:00:00'): nan,
 Timestamp('1781-08-24 00:00:00'): nan,
 Timestamp('1781-09-05 00:00:00'): 'Virginia',
 Timestamp('1781-09-06 00:00:00'): 'Connecticut',
 Timestamp('1781-09-08 00:00:00'): 'South Carolina',
 Timestamp('1781-09-13 00:00:00'): Start Date
 1781-09-13    North Carolina
 1781-09-13          Virginia
 Name: State, dtype: object,
 Timestamp('1781-09-28 00:00:00'): 'Virginia',
 Timestamp('1781-10-03 00:00:00'): 'New York',
 Timestamp('1781-10-21 00:00:00'): nan,
 Timestamp('1781-10-25 00:00:00'): 'New York',
 Timestamp('1781-12-12 00:00:00'): nan,
 Timestamp('1782-01-02 00:00:00'): 'South Carolina',
 Timestamp('1782-01-11 00:00:00'): Start Date
 1782-01-11    NaN
 1782-01-11    NaN
 Name: State, dtype: object,
 Timestamp('1782-01-22 00:00:00'): nan,
 Timestamp('1782-01-25 00:00:00'): nan,
 Timestamp('1782-02-17 00:00:00'): nan,
 Timestamp('1782-02-22 00:00:00'): nan,
 Timestamp('1782-02-24 00:00:00'): 'South Carolina',
 Timestamp('1782-03-08 00:00:00'): 'Ohio',
 Timestamp('1782-03-16 00:00:00'): Start Date
 1782-03-16    NaN
 1782-03-16    NaN
 Name: State, dtype: object,
 Timestamp('1782-03-22 00:00:00'): 'Virginia',
 Timestamp('1782-04-08 00:00:00'): 'New Jersey',
 Timestamp('1782-04-09 00:00:00'): nan,
 Timestamp('1782-04-12 00:00:00'): nan,
 Timestamp('1782-04-19 00:00:00'): nan,
 Timestamp('1782-04-20 00:00:00'): nan,
 Timestamp('1782-05-06 00:00:00'): nan,
 Timestamp('1782-05-25 00:00:00'): nan,
 Timestamp('1782-05-28 00:00:00'): nan,
 Timestamp('1782-07-01 00:00:00'): nan,
 Timestamp('1782-07-06 00:00:00'): nan,
 Timestamp('1782-08-08 00:00:00'): nan,
 Timestamp('1782-08-15 00:00:00'): 'Virginia',
 Timestamp('1782-08-19 00:00:00'): 'Virginia',
 Timestamp('1782-08-26 00:00:00'): 'South Carolina',
 Timestamp('1782-08-25 00:00:00'): nan,
 Timestamp('1782-09-11 00:00:00'): 'Virginia',
 Timestamp('1782-09-13 00:00:00'): nan,
 Timestamp('1782-10-18 00:00:00'): nan,
 Timestamp('1782-12-06 00:00:00'): nan,
 Timestamp('1783-01-22 00:00:00'): 'Virginia'}

In [78]:
# 유일한 값의 개수는 총 몇개인가?
# unique == 17
war.describe()

count                162
unique                17
top       South Carolina
freq                  31
Name: State, dtype: object

In [87]:
# 유일한 값의 개수는 총 몇개인가?
# unique == 17
war.nunique()

17

In [84]:
# Nan 값을 갖는 데이터는 몇개인가??
# war 갯수 중에서 count 된 걸 뺀다.

len(war) - war.count()

70

In [85]:
# Nan 값을 갖는 데이터는 몇개인가??
# war 갯수 중에서 count 된 걸 뺀다.
war.isnull().sum()

70

In [86]:
# 결측치를 제외한 값의 개수는 몇인가?
war.count

<bound method Series.count of Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object>

In [89]:
# nan 값을 배제한다
war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [92]:
# NaT 인덱스는 Not a Time의 줄임말이다.
# 날짜, 시간 유형의 데이터

war.sort_index()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [104]:
# nan값이 존재할 때 nan을 어떻게 정렬할지 기준을 정해줄 수 있다.
# na_position이라는 인수에 first, last값을 사용하면 된다.

war.sort_index(na_position = "first")

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [94]:
war.sort_index(na_position = "last")

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [96]:
# 시리즈 인덱스에 포함된 NaT 값을 배제하는 방법 1
war.loc[war.index.dropna()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [97]:
# 시리즈 인덱스에 포함된 NaT 값을 배제하는 방법 2
war.loc[war.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [102]:
# 내림차순 정렬
google1 = google.sort_values(ascending = False)

google1.head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [112]:
#### 가장 작은 값 10개
google1 = google.sort_values(ascending = True)
google1.head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [113]:
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [114]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [115]:
pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [116]:
bins = np.linspace(0, 1400, 8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [126]:
# 소괄호()는 해당 값의 미포함을 나타내며 대괄호[]는 해당 값을 포함한다는 의미이다.
# 리스트의 모든 인접한 쌍을 각 구간의 하한, 상한값으로 사용한다. 

google2 = google.value_counts(bins=bins)
google2

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [128]:
google2.sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [129]:
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [161]:
# pandas 데이터 csv로 출력하기

data = {"c1": [1, 1.11, "one"], "c2": [2, '', "two"], "c3": ["누락", 3.33, "three"],
}
columns = ["c1","c2", "c3"]
index = [0, 1, 2]
df_csv = pd.DataFrame(data, index=index, columns=columns)
df_csv

     c1   c2     c3
0     1    2     누락
1  1.11        3.33
2   one  two  three

In [162]:
# 파일로 저장이 되었다!
df_csv.to_csv("sample1.csv", index=False)

In [163]:
%pwd

'/Users/ye'

In [172]:
%cd /Users/ye/23_Data analysis

/Users/ye/23_Data analysis

In [210]:
# 읽어낸 데이터에 컬럼 인덱스는 있지만 row 인덱스는 없으므로 0부터 row 인덱스가 추가된 것을 볼 수 있다.

df_read = pd.read_csv("sample1.csv")
df_read

     c1   c2     c3
0     1    2     누락
1  1.11  NaN   3.33
2   one  two  three

In [166]:
df_csv.to_csv("sample2.csv", index=False, header=False)

In [167]:
pd.read_csv("sample2.csv", names=['a', 'b', 'c'])

      a    b      c
0     1    2     누락
1  1.11  NaN   3.33
2   one  two  three

In [180]:
# 아래처럼 %기호가 있을 때는 앞에 주석을 달면 안된다.
# 첫줄부터 바로 시작해야 함!

In [181]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515|

Overwriting sample3.txt

In [209]:
pd.read_csv("sample3.txt")

         c1        c2        c3        c4
0   0.179181 -1.538472  1.347553  0.43381
1   1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515|

In [208]:
# 정규식으로 구분자 처리
pd.read_csv("sample3.txt", sep='\s+')

         c1        c2        c3         c4
0  0.179181 -1.538472  1.347553    0.43381
1  1.024209  0.087307 -1.281997    0.49265
2  0.417899 -2.002308  0.255245  -1.10515|

In [186]:
# 데이터 뿐만 아니라 상단에 부가적인 텍스트가 있는 경우를 살펴본다

In [187]:
%%writefile sample4.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515|

Overwriting sample4.txt

In [193]:
# 리스트 형태로 skiprows 인수를 사용. 0부터 1까진 포함시키지 않겠다?!
# 리스트 대신 range를 사용할 수도 있다.

pd.read_csv('sample4.txt', skiprows=[0,1])

    1.024209  0.087307 -1.281997  0.49265
0  0.417899 -2.002308  0.255245 -1.10515|

In [194]:
# 자료 안 특정한 값을 nan으로 취급하고 싶으면 na_values 인수에 nan 값으로 취급할 값을 넣습니다.

df_na_val = pd.read_csv('sample1.csv', na_values=['누락'])
df_na_val

     c1   c2     c3
0     1    2    NaN
1  1.11  NaN   3.33
2   one  two  three

In [200]:
# 파일을 읽을 때와 마찬가지로 파일을 출력할 때도 sep 인수로 구분자를 바꿀 수 있다.

df_na_val.to_csv('sample5.txt', sep='|')

In [201]:
df_na_val

     c1   c2     c3
0     1    2    NaN
1  1.11  NaN   3.33
2   one  two  three

In [202]:
# 불러올 때와 마찬가지로 저장할 때도 na_rep 키워드 인수를 사용해 nan 표시값을 바꿀 수도 있다.
# 아래 코드를 보면 nan 값을 '누락'으로 변경해 저장한다.

In [206]:
df_na_val.to_csv('sample6.txt', na_rep='누락')

In [207]:
df_na_val

     c1   c2     c3
0     1    2    NaN
1  1.11  NaN   3.33
2   one  two  three

In [205]:
%cd /Users/ye/23_Data analysis/csv

/Users/ye/23_Data analysis/csv

In [211]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [212]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [213]:
titanic.head(20)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y
10,0,male,39.0,1,5,31.2750,Third,unknown,Southampton,n
11,0,female,14.0,0,0,7.8542,Third,unknown,Southampton,y
12,0,male,2.0,4,1,29.1250,Third,unknown,Queenstown,n
13,1,male,28.0,0,0,13.0000,Second,unknown,Southampton,y
14,0,female,31.0,1,0,18.0000,Third,unknown,Southampton,n
15,1,female,28.0,0,0,7.2250,Third,unknown,Cherbourg,y
16,0,male,35.0,0,0,26.0000,Second,unknown,Southampton,y
17,1,male,28.0,0,0,35.5000,First,A,Southampton,y
18,1,female,38.0,1,5,31.3875,Third,unknown,Southampton,n
19,0,male,28.0,0,0,7.2250,Third,unknown,Cherbourg,y

In [218]:
abalone_train = pd.read_csv(
    "https://storage.googleapis.com/download.tensorflow.org/data/abalone_train.csv",
    names=["Length", "Diameter", "Height", "Whole weight", "Shucked weight",
           "Viscera weight", "Shell weight", "Age"])

abalone_train.head()

,Length,Diameter,Height,Whole weight,Shucked weight,Viscera weight,Shell weight,Age
0,0.435,0.335,0.110,0.334,0.1355,0.0775,0.0965,7
1,0.585,0.450,0.125,0.874,0.3545,0.2075,0.2250,6
2,0.655,0.510,0.160,1.092,0.3960,0.2825,0.3700,14
3,0.545,0.425,0.125,0.768,0.2940,0.1495,0.2600,16
4,0.545,0.420,0.130,0.879,0.3740,0.1695,0.2300,13